# Pandas

- Dibuat di atas library Numpy
- Melakukan operasi terhadap Series dan DataFrame

In [ ]:
# Series : seperti array 1-d, hanya saja memiliki label
# DataFrame : seperti array 2-d, memiliki nama column

# Series

In [3]:
import numpy as np
import pandas as pd

In [4]:
# List of string
listChar = ['x', 'y', 'z']
print(listChar)

['x', 'y', 'z']

In [5]:
# List of integer
listNum = [10, 20, 30]
print(listNum)

[10, 20, 30]

In [6]:
# Tupple of integer
tupNum = (10, 20, 30)
print(tupNum)

(10, 20, 30)

In [9]:
# Array of Integer
arrNum = np.arange(10,31,10)
print(arrNum)

[10 20 30]

In [7]:
# Dictionary
dcn = {'a' : 10, 'b': 20, 'c': 30}
print(dcn)

{'a': 10, 'b': 20, 'c': 30}

In [8]:
#series menerima 1 paramere wajib, 1 tidak wajib

serChar = pd.Series(listChar)
print(serChar)
print(serChar[2])

0    x
1    y
2    z
dtype: object
z

In [9]:
serNum = pd.Series(listNum,listChar) #listChar akan menjadi label
print(serNum)

x    10
y    20
z    30
dtype: int64

In [10]:
serNum = pd.Series(data=listNum,index=listChar) #listChar akan menjadi label
print(serNum)

x    10
y    20
z    30
dtype: int64

In [11]:
print(serNum[1])
print(serNum['y'])
print(serNum['y'] + serNum['x'])

20
20
30

In [12]:
print(dcn)

{'a': 10, 'b': 20, 'c': 30}

In [13]:
serDcn = pd.Series(dcn)
print(serDcn)

a    10
b    20
c    30
dtype: int64

In [15]:
serNum + serNum

x    20
y    40
z    60
dtype: int64

In [16]:
serHero1 = pd.Series([1,2,3,4] , ['Axe', 'Windranger', 'Techies', 'Brew'])
print(serHero1)

Axe           1
Windranger    2
Techies       3
Brew          4
dtype: int64

In [17]:
serHero2 = pd.Series([1,2,3,4] , ['Axe', 'Windranger', 'Invoker', 'Brew'])
print(serHero2)

Axe           1
Windranger    2
Invoker       3
Brew          4
dtype: int64

In [18]:
resSum =serHero1 + serHero2
print(resSum)
print(np.isnan(resSum['Invoker']))
print(np.isnan(resSum['Axe']))

Axe           2.0
Brew          8.0
Invoker       NaN
Techies       NaN
Windranger    4.0
dtype: float64
True
False

# DATA FRAME

In [22]:
import numpy as np
import pandas as pd
from numpy.random import randn,randint #randint hanya 1-d & randn 2-d

In [23]:
np.random.seed(101)

In [24]:
# randn(5,4) , random number 2-d, 5 baris - 4 kolom
# DataFrame Parameter : data (2-d), index, column
dfNum = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
#Akses berdasarkan kolom
dfNum['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [26]:
#Akses lebih dari satu kolom
dfNum[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [27]:
#Menambahkan kolom baru 'WY', datanya dari penjumlahan kolom 'W'&'Y'
dfNum['WY'] = dfNum['W'] + dfNum['Y']
dfNum

          W         X         Y         Z        WY
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

Drop

In [28]:
#AXIS

# DataFrame memiliki dua axis (default axis = 0)
# axis = 0 menunjuk baris [A B C D E]
# axis = 1 menunjuk kolom [W, X, Y, Z, WY]

In [29]:
# inplace = False, tidak menghapus dataframe asli, melainkan return dataframe baru
dfDropped = dfNum.drop('WY', axis=1)
dfDropped

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
dfNum

          W         X         Y         Z        WY
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [31]:
# inplace = True, menghapus dataframe aslinya.
dfNum.drop('WY', axis=1, inplace=True)
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
dfNum.drop(['W','X'],axis=1) #Drop 2 kolom

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

LOC for LABEL

In [33]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
dfNum.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [35]:
dfNum.loc['B','W']

0.6511179479432686

In [36]:
dfNum.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [37]:
dfNum.loc[['A','B'],['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

ILOC for INDEX

In [38]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
dfNum.loc['B'] #menggunakan label 'B'

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [40]:
dfNum.iloc[1] #menggunakan index

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [41]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
dfNum.iloc[1:3, 2:4]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001

In [89]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
dfNum.iloc[1:4, 2:4]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

In [44]:
dfNum.iloc[3: , 1:4]

          X         Y         Z
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [45]:
dfNum.iloc[1:4, :1]

          W
B  0.651118
C -2.018168
D  0.188695

In [46]:
dfNum.drop(['X'],axis=1)

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001
D  0.188695 -0.933237  0.955057
E  0.190794  2.605967  0.683509

In [47]:
dfNum2 = dfNum.drop(['Z'],axis =1)
print(dfNum2)

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [48]:
dfNum2.drop(['C'],axis =0)

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

# DEFAULT PARAMETER

In [50]:
def manyParams(a=2, b=2, c=2, d=2, e=2, f=2, g=2, h=2, i=2):
    print(f'Isi dari parameter a : {a}')
    print(f'Isi dari parameter e : {e}')
    print(f'Isi dari parameter i : {i}')

In [51]:
manyParams('A', 'x', 'x', 'x', 'E', 'x', 'x', 'x', 'I')

Isi dari parameter a : A
Isi dari parameter e : E
Isi dari parameter i : I

In [52]:
manyParams(a='A', e='E', i='I')

Isi dari parameter a : A
Isi dari parameter e : E
Isi dari parameter i : I